furry_character_dict = {
    "物种": ['兔', '熊', '牛', '犬', '狮', '狸', '狼', '猪', '猫', '羊', '虎', '象', '豹', '鸟', '鸡', '鼠', '龙', '仓鼠', '刺猬', '敖犬', '松鼠',
           '水獭', '水貂', '河狸', '浣熊', '海豚', '熊猫', '犀牛', '狐狸', '狞猫', '猕猴', '猞猁', '猩猩', '红狐', '羚羊', '藏狐', '虎鲸', '蜥蜴', '蝙蝠',
           '角鲨', '豚鼠', '豪猪', '野牛', '野猪', '雪豹', '驯鹿', '鬃狼', '鲸鱼', '鸭子', '麋鹿', '变色龙', '小熊猫', '短吻鳄', '耳廓狐', '鸭嘴兽'],
    "角色": {
        0.1: "普通兽人",
        1: ['教主', '护士', '学生', '人偶', '天使', '神父', '恶魔', '精灵', '亡灵', '法师', '骑士', '律师', '囚犯', '教师', '农民', '奴隶', '工人',
            '水手', '总统', '司机', '法官', '军事', '流氓', '巫师', '国王', '狱卒', '歌手', '斥候', '歌姬', '舞者', '小丑', '剑士', '射手', '僵尸',
            '步兵', '下课', '刺客', 'DJ', '武士', '变态', '兽医', '治疗', '黑客', '黑帮', '特警', '警察', '明星', '猎人', '卫兵', '将军', '铁匠',
            '伯爵', '异性', '宅男', '渔夫', '牛仔', '丧尸', '船长', '厨师', '先锋', '学者', '园丁', '商人', '侦探', '戏子', '法老', '管家', '海盗',
            '武僧', '忍者', '医生', '强盗', '总裁', '牧师', '雇佣兵', '清洁工', '魔术师', '德鲁伊', '格斗家', '探险家', '流浪汉', '掘墓者', '运动员', '狙击手',
            '精神病', '元素师', '狂战士', '轻骑兵', '占卜师', '古筝手', '警卫队', '外星人', '服务员', '跆拳道', '魔剑士', '科学家', '圣战士', '摄影师', '上班族',
            '驯兽师', '飞行员', '阴阳师', '火枪手', '宇航员', '圣骑士', '牧羊人', '摔跤手', '糕点师', '龙骑士', '召唤兽', '潜水员', '救生员', '封印师', '算命先生',
            '消防人员', '印第安人', '占星术士', '死灵术士', '未来战士', '游戏玩家', '儿科医生', '炼金术士', '吟游诗人', '药剂研究员']
    },
    "性格": ['专一', '严厉', '严肃', '主见', '乐观', '亲切', '优秀', '优质', '优雅', '伟大', '体谅', '体贴', '保守', '倔强', '健谈', '傲娇', '元气', '八七',
           '公正', '内向', '内敛', '冲动', '冷漠', '冷静', '分裂', '刚强', '刚愎', '务实', '勇敢', '勤劳', '勤勉', '勤奋', '卑微', '单纯', '厌恶', '友好',
           '反感', '可敬', '呆萌', '和蔼', '善良', '固执', '坚强', '坚持', '坦率', '外向', '多疑', '大胆', '天然', '天真', '妩媚', '孝顺', '孤僻', '孤独',
           '守旧', '实干', '客观', '害羞', '寡情', '小气', '少言', '幽默', '庄重', '开放', '开朗', '忍让', '忠厚', '忠诚', '忧虑', '忧郁', '怜悯', '急躁',
           '怯懦', '悠闲', '悲观', '慎重', '慵懒', '慷慨', '憨厚', '懒惰', '才干', '执拗', '挑剔', '敏感', '无知', '无虑', '普通', '暴躁', '朝气', '木讷',
           '朴实', '机敏', '机灵', '果敢', '正直', '毒舌', '沉稳', '沉重', '沉默', '洒脱', '活泼', '浮躁', '淘气', '深沉', '温柔', '温顺', '滑稽', '热心',
           '热情', '犹豫', '狂妄', '狂暴', '狠厉', '狡猾', '狡诈', '独立', '狭隘', '猥琐', '率真', '理智', '畏缩', '疯狂', '病娇', '痴情', '直爽', '知性',
           '礼貌', '积极', '稳重', '端庄', '笨蛋', '粗心', '粗鲁', '细心', '羞怯', '老练', '耐心', '聪明', '胆小', '腹黑', '腼腆', '自大', '自尊', '自负',
           '色欲', '莽撞', '萎靡', '虚弱', '认真', '讨厌', '诚恳', '调皮', '谦虚', '谦逊', '谨慎', '豁达', '豪爽', '踏实', '迟钝', '迷人', '迷糊', '逗比',
           '邪恶', '阴沉', '阴郁', '随和', '顺从', '顽强', '顽皮', '风趣', '马虎', '高冷'],
    "体格": {
        0.75: ["高大", "矮小", "普通"], 1: ["巨人", "矮人"]
    },
    "毛色": ["红色", "黑色", "白色", "紫色", "绿色", "黄色", "蓝色", "灰色", "橙色", "青色"],
    "发色": ["红色", "黑色", "白色", "紫色", "绿色", "黄色", "蓝色", "灰色", "橙色", "青色"],
    "巩膜": {
        0.125: "黑色",
        1: "白色"
    },
    "瞳色": ["红色", "黑色", "白色", "紫色", "绿色", "黄色", "蓝色", "灰色", "橙色", "青色"],
    "手持": ['弓', '伞', '书', '弩', '斧头', '镰刀', '锤子', '双剑', '巨剑', '扫把', '铲子', '旗帜', '玩偶', '方盾', '吉他', '硬币', '匕首', '砍刀', '法杖',
           '棺材', '铁链', '手杖', '手机', '皮鞭', '锄头', '粉笔', '圆盾', '钢笔', '飞镖', '弯刀', '飞到', '长矛', '弩箭', '燧石', '战锤', '权杖', '单手剑',
           '现代枪', '武士刀', '钓鱼竿', '水果刀', '电线杆', '狼牙棒', '电吉他', '烧火棍', '西瓜刀', '钥匙串', '收租本', '黑板擦', '双刃剑', '斩马刀', '青铜剑',
           '棒球棍', '判官笔', '加特林', '三节棍', '魔法杖', '长戟/枪', '棒球套装', '左轮手枪', '物理学圣剑', '神秘手提箱', '朗吉努斯之枪', '史密斯冲锋枪', '拖拉机车钥匙'],
    "衣着": ["拼色短袖", "男式工装", "西装", "英伦风外套", "羽绒服", "程序猿格子衫", "棉服背心", "V领背心", "运动汗衫", "针织毛衣", "高领毛衣", "兜帽卫衣", "过膝盖潮流风衣",
           "Polo 衫", "背带裤", "工装连体裤", "皮质夹克", "雨衣", "摩托黑色夹克", "飞行员夹克", "羊毛外套", "蓬松短夹克", "连帽衫", "绅士外套", "呢大衣", "温泉浴衣",
           "浴袍", "条纹衬衫", "翻领短袖", "多用冲锋衣", "棒球外套", "篮球衫", "橄榄球球衣", "速干训练衣", "速干紧身衣", "田径服", "水上运动服", "摔跤服", "击剑服", "潜水衣",
           "校服", "忍者服装", "僧侣服装", "航空服", "沙滩T恤", "披风", "汉服", "唐装", "传统和服", "白大褂", "执事服", "燕尾服", "厨师衣", "衬衫夹克", "迷彩服",
           "水手服", "格子衬衫", "警服", "罗马服装", "商朝饕餮盔甲", "战国皮甲", "秦国铁甲", "唐朝明光铠", "明朝山文甲", "清朝棉甲", "宋朝步人甲", "外骨骼装甲", "锁子甲",
           "板甲", "鳞甲", "环甲", "增殖装甲", "沙漠服饰", "女仆装", "哥特萝莉装", "无"],
    "配饰": ["机械手", "眼镜", "翅膀", "机械腿", "渔夫帽", "面具", "眼罩", "角", "机械尾巴", "伤痕", "金箍", "斗笠", "胸针", "大红花", "金丝框眼镜", "擦汗毛巾", "无"
           ],
    "体型": {
        0.333333: ["较少脂肪", "较多脂肪", "大块脂肪", "超多脂肪"],
        0.666667: "普通",
        1: ["较少肌肉", "较多肌肉", "大块肌肉", "超多肌肉"]
    },
    "脚部": {
        0.375: ["运动鞋", "皮鞋"],
        0.5: ["军靴", "脚镣", "木屐"],
        1: "无",
    }
}
